---
title: Лабораторная работа №1
description: Отчёт по первой лабораторной работе
---

# :one: Лабораторная работа №1

> **Тема**: *[Укажите тему, например: «Знакомство с Python и базовыми структурами данных»]*  
> **Вариант**: №X  
> **Дата выполнения**: 15.01.2026  
> **Статус**: :material-check-circle: Защищена

---

## 🎯 Цель работы

-   Изучить [основные концепции/инструменты]
-   Научиться [конкретный навык]
-   Реализовать [задачу/алгоритм]

## 📝 Задание

!!! example "Условие"
    1.  Разработать программу для...
    2.  Обработать входные данные...
    3.  Вывести результат в формате...

    **Критерии оценки**:
    -   [ ] Корректность алгоритма
    -   [ ] Читаемость кода
    -   [ ] Наличие комментариев
    -   [ ] Тестовые примеры

---

## 💻 Исходный код

=== "main.py"
    ```python
    #!/usr/bin/env python3
    # -*- coding: utf-8 -*-
    """
    Лабораторная работа №1
    Автор: Сырчин Андрей
    """

    def main():
        # Ваш код здесь
        print("Hello, Lab 1! 🚀")
        return 0

    if __name__ == "__main__":
        exit(main())
    ```

=== "requirements.txt"
    ```text
    # Зависимости проекта
    numpy>=1.24.0
    pandas>=2.0.0
    ```

!!! info "Запуск"
    ```bash
    python main.py
    # или
    pip install -r requirements.txt && python main.py
    ```

---

## 📊 Результаты выполнения

### Тестовые данные

| Входные данные | Ожидаемый результат | Фактический результат | Статус |
|---------------|-------------------|---------------------|--------|
| `input_1` | `expected_1` | `actual_1` | ✅ |
| `input_2` | `expected_2` | `actual_2` | ✅ |
| `edge_case` | `expected_edge` | `actual_edge` | ✅ |

### Вывод программы

```text
$ python main.py
Hello, Lab 1! 🚀
[Дополнительный вывод...]
Process finished with exit code 0